//
//  Session.swift
//  newVK
//
//  Created by Николай Онучин on 21.04.2022.
//

import Foundation

/// Этот синглтон предназначен для хранения информации о текущем пользователе приложения.
/// - parameters:
///   - token: Токен доступа текущего пользователя к серверу.
///   - userId: Идентификатор текущего пользователя.

final class Session {
    /// Статическая константа с экземпляром этого же класса.
    static let instance = Session()
    /// Приватный конструктор, запрещающий создание экземпляров класса.
    private init() {}
    
    /// Токен доступа текущего пользователя к серверу.
    var token: String?
    ///  Идентификатор текущего пользователя.
    var userId: Int?
}
